# Импорт основных модулей для работы с API симулятора
from agrotechsimapi import SimClient
import time
import numpy as np

def main():
    # Флаг для управления основным циклом программы
    is_loop = True
    
    # Создание клиента для подключения к симулятору
    # Подключение к локальному серверу симулятора на порту 8080
    client = SimClient(address="127.0.0.1", port=8080)
    
    # Инициализация переменных для управления интенсивностью
    intensity = 0
    step = 0.02

    # Актуальный RPC управляет цветом диода. Нулевой цвет выключает его.
    client.set_Diod(0, 1.0, 1.0, 1.0)
    
    # Основной цикл мигания светодиодов
    while is_loop:
        # Выключение обоих светодиодов (led_id 0 и 1)
        client.set_Diod(0, 0.0, 0.0, 0.0)
        client.set_Diod(1, 0.0, 0.0, 0.0)
        
        # Пауза 0.5 секунды с выключенными светодиодами
        time.sleep(1/2)
        
        # Включение обоих светодиодов
        client.set_Diod(0, 1.0, 1.0, 1.0)
        client.set_Diod(1, 1.0, 1.0, 1.0)
        
        # Пауза 0.5 секунды с включенными светодиодами
        time.sleep(1/2)

if __name__ == "__main__":
    main()
